public/ephemeris/2025-03-16.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="../autobiography/chronological.html">Chronological</a> &gt; <a href="ephemeris.html">Ephemeris</a> &gt; <a href="entries.html">Entries</a> &gt;
</p>

<div id="outline-container-orgae7abbe" class="outline-2">
<h2 id="orgae7abbe">2025-03-16</h2>
<div class="outline-text-2" id="text-orgae7abbe">
<p>
I was taking a walk in my neighbourhood, there is not much too see
here. A couple of small parks, some triees, and mostly residential
houses. Yesterday I was watching a live of Prod. in real time, he was
just answering some questions from chat. He is such an interesting
and unique person, let me elaborate. Some people know him for his
philosophy videos, I belive he has a formal education in philosophy
and he often records his walks where he openly shared hit thoughts.
He lives a simple life in the mountain, with little to no human
contact or even electricity. Some other people know him for his
emacs videos: he is a maintainer of some well-known pacakges and he is
surely very knowledgable about his emacs-craft. He brings this two
worlds togheter, this is why I think he is so unique.
I started to watch his emacs videos and became interested into the
philosophy ones. What strikes me is his self aweareness. Just by
talking, he uncovered some of my own inner hazards and helped me
get more aware of them.
</p>

<p>
[ Here I have redacted some pages where I reflect about myself, I
am still unsure on how much to share here so I will redact this for
now ]
</p>

<p>
Another point of reflection of this walk was history and searching
through old stuff. In the park where I usually go there is a small
wooden shelf under some stone structure. It is one of those shelfes
where people may take or leave any book. I always stop there to see
new books and If something interests me I would take it home for
some time. Some of the books are narrative, some of them are
didactical books, most of them are very old. What fascinates me is how
those pieces of paper can open a window into the past and look at
the world from a totally different prospective. For example, there
was a local newspaper from a lot of time ago, it was one of the
first with colored ink. It looked like from another era, totally
another style. I imagined how people reading this newspaper looked
like and I find it peaceful. I am attracted to a simpler life,
and I enjoy those thoughts.
</p>

<p>
[ Here I redacted some more pages, but basically I was getting
inspired to start writing some stories ]
</p>

<p>
Anyway, I am heading back home right now. I updated my todo list with
some stuff.
</p>

<hr />

<p>
Travel: <a href="ephemeris.html">Ephemeris</a>, <a href="../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
